'''
读入一个整数N，N是奇数，输出由星号字符组成的等边三角形，要求：‪‬‪‬‪‬‪‬‪‬‮‬‫‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‪‬
第1行1个星号，第2行3个星号，第3行5个星号，依次类推，最后一行共N的星号。‪‬‪‬‪‬‪‬‪‬‮‬‫‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‪‬
'''
#check whether number is odd number
num = eval(input("input a num:"))
if num % 2 == 0:
    #print("not odd,exit")
    print("")
else:
    #print("it is odd")
    print("{:*^5}".format(num))   #**5**  5个长度居中， 字符是num
    for i in range(1,num+1,2):
        print("{0:^{1:}}".format("*"*i,num))    #{1:} 代表第二个参数，用来表示第一个参数的宽度 
       
'''
it is odd
**3**
 * 
***
'''